// 1 指针数组的赋值
#include <stdio.h>

int main()
{
    int a[3][2] = {{1, 2}, {3, 4}, {5, 6}};
    int *p[3] = {*(a + 0), a[1], &a[2][0]};
    /*
    1.必须要完全初始化 只给一个a[0]会报警告
    2.数组元素是列指针（每行首元素，三种写法），不是行指针。行指针用得极少，数组指针赋值会用，其他情况基本一概列指针
    */
    printf("%d %d", p[0][1], p[1][1]);
    return 0;
}

// 2 二级指针的应用
// 首先声明 二级指针也是一种"二维指针" 但没法直接指向二维数组 必须借助指针数组
// 不实用 了解即可
#include <stdio.h>

int main()
{
    int a[3][2] = {{1, 2}, {3, 4}, {5, 6}};
    int *p[3] = {*(a + 0), a[1], &a[2][0]};               // 取二维数组a每一行的首元素地址
    int **b = p;                                          // 取指针数组p的首元素地址
    printf("%d %d", b[0][1], b[1][1]);                    // b等价于a了
    printf("%p %p %p", b[1] + 1, &a[1][1], *(p + 1) + 1); // 三种等效写法 当然这实际上是列指针 不过列指针一般取首元素地址
    return 0;
}

// 如果不用指针数组 只用一个一级指针 那这样b会越界的
#include <stdio.h>

int main()
{
    int a[3][2] = {{1, 2}, {3, 4}, {5, 6}};
    int *p = a[0];
    int **b = &p;
    printf("%d %d", b[0][1], b[0][0]);
    return 0;
}

// 3 二级指针与malloc
// 详见“二维数组与指针”
