// 相比于母题摘花生，本题需要走两次

// 状态表示 f(i1,j1,i2,j2)
// 集合：表示所有从(1,1)(1,1)分别走到(i1,j1)(i2,j2)的路线
// 属性：max

// 注意到，由于只能向下走或向右走，因此两条路线的横纵坐标之和是相同的，即i1+j1=i2+j2
// 即每条路线移动到终点的步数是一样的
// 据此，优化状态：
// f(k,i1,i2) 表示从(1,1)走到(i1,k-i1)和(i2,k-i2)的路线
// k表示两条线路当前走到格子的横纵坐标之和，即k=i1+j1=i2+j2

// 状态计算
// 每条路线每次移动有两种选择：向下走或向右走，因此组合起来有四种情况
// 子状态分为四部分(状态表示所取的时刻为一般情况的前一个时刻，即“考虑最后一步的前一步”)：
// 1. 第一条路线向下走，第二条路线向下走：f(k-1,i1-1,i2-1)
// 2. 第一条路线向下走，第二条路线向右走：f(k-1,i1-1,i2)
// 3. 第一条路线向右走，第二条路线向下走：f(k-1,i1,i2-1)
// 4. 第一条路线向右走，第二条路线向右走：f(k-1,i1,i2)
// 四类中取最大值

// 考虑如何处理“同一个格子不能被重复选择”
// 以子状态1为例，如果 i1==i2 && j1==j2，说明来到了同一个格子，此时只加一次权值；否则加各自权值(共两次)

#include <iostream>
#include <cstring>
#include <algorithm>

using namespace std;

const int N = 15;

int n;
int w[N][N];
int f[N * 2][N][N];

int main() {
    ios::sync_with_stdio(false);
    cin.tie(0);

    cin >> n;
    int a, b, c;
    while (cin >> a >> b >> c, a || b || c) {
        w[a][b] = c;
    }

    // 从最外层开始遍历，k最小为1+1=2，最大为n+n=2n
    for (int k = 2; k <= n * 2; k++) {
        for (int i1 = 1; i1 <= n; i1++) {
            for (int i2 = 1; i2 <= n; i2++) {
                int j1 = k - i1, j2 = k - i2;
                // 越界判断
                if (j1 >= 1 && j1 <= n && j2 >= 1 && j2 <= n) {
                    // 同一格判断
                    int t = w[i1][j1];
                    if (i1 != i2) {
                        t += w[i2][j2];
                    }
                    // 取别名，x完全等价于f[k][i1][i2]，而不是创建一个副本
                    int& x = f[k][i1][i2];
                    x = max(x, f[k-1][i1-1][i2-1] + t);
                    x = max(x, f[k-1][i1-1][i2] + t);
                    x = max(x, f[k-1][i1][i2-1] + t);
                    x = max(x, f[k-1][i1][i2] + t);
                }
            }
        }
    }

    cout << f[n * 2][n][n] << endl;
    
    return 0;
}
