// 两个状态已经不够用了，本题还需要考虑“冷冻期”这个状态
// 不过本题没有交易笔数这个维度了
// 因此，“手中无货”要进行拆分——手中无货的第1天、手中无货的>=2天
// 状态分配方面，不需要像数电一样限制二进制，状态分配取0，1，2即可
// 0->持有股票 1->手中无货的第1天 2->手中无货的>=2天

// 下面描述状态机。为了方便，描述每个点的出边；注意方程需要根据入边来写
// 0: 0->0(不卖) 0->1(卖出+w[i])
// 1: 1->2(卖出后，第二天不得买入)
// 2: 2->2(不买) 2->0(买入-w[i])

// 入口为2，因为第一天可以买入，没有初始cd
// 出口可能在1或2，0手上有票不卖必亏；
// 因此初始化f[0][2]=0, f[0][0]=f[0][1]=-inf

// 下面写状态转移方程
// f(i,0) = max{ f(i-1,0), f(i-1,2)-w[i] }
// f(i,1) = f(i-1,0)+w[i]
// f(i,2) = max{ f(i-1,1), f(i-1,2) }

#include <algorithm>
#include <cstring>
#include <iostream>


using namespace std;

const int N = 1e5 + 10, INF = 0x3f3f3f3f;

int n;
int f[N][3];
int w[N];

int main() {
    ios::sync_with_stdio(false);
    cin.tie(0);

    cin >> n;
    for (int i = 1; i <= n; i++) {
        cin >> w[i];
    }

    // 状态机入口——初始化状态
    f[0][2] = 0;
    f[0][0] = f[0][1] = -INF;

    for (int i = 1; i <= n; i++) {
        f[i][0] = max(f[i - 1][0], f[i - 1][2] - w[i]);
        f[i][1] = f[i - 1][0] + w[i];
        f[i][2] = max(f[i - 1][1], f[i - 1][2]);
    }

    // 状态机出口——输出答案
    cout << max(f[n][1], f[n][2]) << endl;

    return 0;
}
